felixfelix-bot/tollgate-esp32/mining-standalone/sdkconfig.defaults
# --- ESP32-S3 target ---
CONFIG_IDF_TARGET="esp32s3"

# --- Flash / Partition ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM (ESP32-S3 N8R8 / tollgate boards) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# --- WiFi ---
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_NVS_ENABLED=y

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000

# --- LWIP ---
CONFIG_LWIP_MAX_SOCKETS=16

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
